MarvAmBass/klingelbox/firmware/sdkconfig.defaults
# sdkconfig.defaults — doorbell433 (ESP32-S3 433 MHz doorbell server).
#
# Committed so a fresh checkout and CI produce identical firmware. Regenerate the
# full sdkconfig with `idf.py set-target esp32s3` (it seeds from this file).

# ---- Target ---------------------------------------------------------------
CONFIG_IDF_TARGET="esp32s3"

# ---- Console --------------------------------------------------------------
# The S3 is reached over its NATIVE USB (USB-Serial/JTAG), not a UART bridge, so
# route console/logs there — otherwise logs go out the UART0 pins and USB is silent.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# ---- Flash & partition table ---------------------------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ---- PSRAM: deliberately OFF ---------------------------------------------
# This dev board HAS 8 MB octal PSRAM, but the eventual target (ESP32-S3 Zero)
# has none — and enabling SPIRAM on a module without it HANGS AT BOOT. Nothing in
# this firmware needs it (RF capture buffers are a few KB), so the portable
# default wins. To use it on this board only, uncomment:
#   CONFIG_SPIRAM=y
#   CONFIG_SPIRAM_MODE_OCT=y
#   CONFIG_SPIRAM_SPEED_80M=y

# ---- RMT: the RF capture peripheral --------------------------------------
# Pulse timings must survive Wi-Fi, HTTP and NVS/SPIFFS writes. Putting the RMT
# ISR in IRAM keeps edge capture running even while the flash cache is disabled
# during a flash write — without this, a config save can smear a capture.
# NOTE: any RMT callback must then be IRAM_ATTR and touch no flash-resident data.
CONFIG_RMT_ISR_IRAM_SAFE=y

# ---- Main task ------------------------------------------------------------
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144

# ---- Wi-Fi: softAP + STA at once (APSTA) ---------------------------------
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_LWIP_DHCPS=y

# ---- lwIP -----------------------------------------------------------------
# 16, up from 12: with TLS enabled TWO httpd instances run at once (HTTPS on
# :443 with 3 data sockets + listener + control, and the :80 redirect helper
# with 2 + listener + control) beside MQTT, mDNS and the captive DNS. At 12,
# the second server could fail to start exactly when everything else is busy.
CONFIG_LWIP_MAX_SOCKETS=16
# (CONFIG_LWIP_SO_RCVTIMEO was dropped upstream — SO_RCVTIMEO is always
#  available in IDF 5.x. Setting it here only produced an 'unknown kconfig
#  symbol' warning, which CI now treats as a failure.)
CONFIG_LWIP_SO_REUSE=y
CONFIG_LWIP_IPV4=y

# ---- HTTP server ----------------------------------------------------------
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_HTTPD_PURGE_BUF_LEN=64
# The optional-TLS personality of the web server (http_api.c / db_tls.c).
CONFIG_ESP_HTTPS_SERVER_ENABLE=y

# ---- OTA ------------------------------------------------------------------
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y

# ---- mbedTLS: tuned for a no-PSRAM S3 that can SERVE TLS ------------------
# Both roles run here: the OTA/update-check CLIENT (GitHub over HTTPS, via the
# certificate bundle) and, when the user enables it, the HTTPS SERVER with the
# on-device ECDSA identity (db_tls.c).
#
# Dynamic buffers take a TLS connection from ~42 KB to ~20 KB peak and nearly
# nothing at idle (Espressif's numbers) — on ~110 KB of free heap that is the
# difference between one HTTPS connection and the three the server allows.
# They depend on DTLS staying off, which nothing here needs. FREE_CONFIG_DATA
# and FREE_CA_CERT additionally drop the handshake-only material (CA chains,
# DHM params) once a session is up; the OTA client re-attaches the bundle per
# connection, so freeing it costs nothing.
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT=y
# Asymmetric record buffers. IN must stay the full 16384: peers may legally
# send 16 KB records and the server cannot negotiate them down (browsers offer
# no Max Fragment Length), so the OTA browser-upload over HTTPS would die on
# its first large record with a smaller value. OUT stays 4096 because our own
# response chunks are small and under our control. These match the IDF
# defaults; they are pinned here because the server depends on them.
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096
# Key exchange: ECDHE only, in both cert flavours. ECDHE_ECDSA serves our own
# P-256 identity (the S3 has no ECC accelerator, but software ECDSA still
# beats hardware RSA-4096 by ~10x per handshake — which is why the identity
# is ECDSA in the first place, see db_tls.h). ECDHE_RSA stays ON for the OTA
# CLIENT: GitHub's release CDN may present an RSA certificate, and an RSA
# certificate over an ECDHE exchange is exactly that suite. What goes is
# STATIC RSA and finite-field DHE — no modern server or client needs either,
# and dropping them trims the mbedTLS code the image carries.
CONFIG_MBEDTLS_KEY_EXCHANGE_RSA=n
CONFIG_MBEDTLS_KEY_EXCHANGE_DHE_RSA=n
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y

# ---- FreeRTOS -------------------------------------------------------------
CONFIG_FREERTOS_HZ=1000
